<a href="https://colab.research.google.com/github/prveena/datascience/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#import module pandas
import pandas as pd

In [ ]:

#print a series
a=['a','b','c','d']
s=pd.Series(a)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
#print series with index
a=['Apple','Banana','Cat']
s=pd.Series(a,index=['A','B','C'])
print(s)

A     Apple
B    Banana
C       Cat
dtype: object

In [ ]:
#locating value in series using index
a=['Apple','Banana','Cat']
s=pd.Series(a,index=['A','B','C'])
print(s['A'])

Apple

In [ ]:
#series using dictionary
dict={'A':'Apple','B':'Ball','C':'Cat'}
s=pd.Series(dict)
print(s)

A    Apple
B     Ball
C      Cat
dtype: object

In [ ]:
#multiples of 2 and 3
a = [i
     for i in range (31)
       if (i % 3 == 0) and (i % 2 == 0)]
s=pd.Series(a)
print(s[1:])

1     6
2    12
3    18
4    24
5    30
dtype: int64

In [ ]:
#Course and number of students using series
a=['30','55','20']
s=pd.Series(a,index=['MCA','MTech','BTech'])
print(s)

MCA      30
MTech    55
BTech    20
dtype: object

In [ ]:
#Course and number of students using dataframe
data = {"Batch": ['MCA', 'BCA', 'BTech'], "Number of Students": [50, 40, 45]}
d=pd.DataFrame(data,index=['B1','B2','B3'])
print(d)

    Batch  Number of Students
B1    MCA                  50
B2    BCA                  40
B3  BTech                  45

In [ ]:
#Details of 5 students using dataframe
data = {"Name": ['Ayesha', 'Sree', 'Praveena','Sam','Eve'],
         "Percentage": [80, 90, 95,55,75],
         "Grade":['B','A','A','D','C']}
d=pd.DataFrame(data)
print(d)

       Name  Percentage Grade
0    Ayesha          80     B
1      Sree          90     A
2  Praveena          95     A
3       Sam          55     D
4       Eve          75     C

In [ ]:
df.dropna()

   Roll number    name   mark
0            1     Arun    76
1            2  Anthony    84
2            3      Sam    92
3            4    Smith    66
4            5     Zoya    99
5            1     Arun    76

In [ ]:
#Details of 5 students using dataframe WITH INDEX NAME
data = {"Percentage": [80, 90, 95,55,75],
         "Grade":['B','A','A','D','C']}
d=pd.DataFrame(data,index=['Ayesha', 'Sree', 'Praveena','Sam','Eve'])
print(d)

          Percentage Grade
Ayesha            80     B
Sree              90     A
Praveena          95     A
Sam               55     D
Eve               75     C

In [ ]:
print(df)

   Roll number    name   mark
0            1     Arun    76
1            2  Anthony    84
2            3      Sam    92
3            4    Smith    66
4            5     Zoya    99

In [ ]:
#loc function
print(d.loc[[2,3]])

       Name  Percentage Grade
2  Praveena          95     A
3       Sam          55     D

In [ ]:
with open('data.csv','rt')as f:
  data = csv.reader(f)
  for row in data:
        print(row)

['\ufeffProgramming language', 'Designed by', 'Appeared', 'Extension']
['Python', 'Guido van Rossum', '1991', '.py']
['Java', 'James Gosling', '1995', '.java']
['C++', 'Bjarne Stroustrup', '1983', '.cpp']

In [ ]:
df = pd.read_csv ('std1.csv')
# print(df)
dup = df.duplicated()
print(dup)

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [ ]:
df = pd.read_csv ('std1.csv')
dup=df.drop_duplicates()
print(dup)

   Roll number    name   mark
0            1     Arun    76
1            2  Anthony    84
2            3      Sam    92
3            4    Smith    66
4            5     Zoya    99

In [ ]:
df.head(3)

   Roll number    name   mark
0            1     Arun    76
1            2  Anthony    84
2            3      Sam    92

In [ ]:
df.tail(2)

   Roll number name   mark
4            5  Zoya    99
5            1  Arun    76

In [ ]:
df.corr()

             Roll number      mark
Roll number     1.000000  0.411412
mark            0.411412  1.000000

In [ ]:
import numpy as np # import NumPy with alias
import pandas as pd
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print("Serires :",series3)
print("Array :",array1)

Serires : 0    1
1    2
2    3
3    4
dtype: int64
Array : [1 2 3 4]